# Создайте словарь "car" с ключами "марка", "модель" и "год". Присвойте значения соответствующим ключам.
car = {"марка": "Skoda", "модель": "Octavia A7FL", "год": 2019}
# Добавьте в словарь "car" новый ключ-значение "цвет" со значением "черный".
car["цвет"] = "черный"
# Выведите значение ключа "марка" из словаря "car".
print(car["марка"])
# Создайте список "fruits" и добавьте в него названия нескольких фруктов.
fruits = ["нектарин", "абрикос", "персик", "яблоко", "банан"]
# Выведите на экран первый элемент из списка "fruits".
print(fruits[0])
# Создайте кортеж "numbers" и запишите в него несколько чисел.
numbers = (1, 3, 7, 17, 22, 35)
# Выведите на экран последний элемент из кортежа "numbers".
print(numbers[-1])